# CurveByPointsUtils Properties

---
The CurveByPointsUtils type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace